import UIKit

struct User {
    let fullname: String
    let avatar: String
    let publications: [String]
    var age: String = ""
    var city: String = ""
}

var friends = [
    User(fullname: "Димулик Котов", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Настасья", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Галина", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Эдик", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "", city: "Москва"),
    User(fullname: "Руслан", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Димулик Савельев", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Митя", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: ""),
    User(fullname: "Бальжина", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Антон", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "", city: "Москва"),
    User(fullname: "Андрей", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Димулик Котов", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Даня", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Полина", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Саша", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "", city: "Москва"),
    User(fullname: "Тимофей", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Димулик Савельев", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Матвей", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: ""),
    User(fullname: "Максим", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Димулик", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "", city: "Москва"),
    User(fullname: "Димулик", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Димулик Котов", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Димулик", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Димулик", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Димулик", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "", city: "Москва"),
    User(fullname: "Димулик", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Димулик Савельев", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Димулик", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: ""),
    User(fullname: "Димулик", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва"),
    User(fullname: "Димулик", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "", city: "Москва"),
    User(fullname: "Димулик", avatar: "Димулик",
         publications: ["Димулик_1", "Димулик_2", "Димулик_3", "Димулик_4", "Димулик_5", "Димулик_6", "Димулик_7"],
         age: "19", city: "Москва")]

var sectionTitles = [String]()


func sortFriends() {
    let a = Dictionary(grouping: friends, by: { $0.fullname.prefix(1)} )
    a.sorted(by: { $0.key < $1.key } )
}

sortFriends()




//for friend in friends {
//    let firstChar = String(friend.fullname.prefix(1))
////            if !sectionTitles.contains(where: { $0 == firstChar }) {
////                sectionTitles.append(String(firstChar))
////                sortedFriends[String(firstChar)]?.append(friend)
////            } else {
////                sortedFriends[String(firstChar)]?.append(friend)
////            }
//    if sortedFriends[firstChar] != nil {
//        sortedFriends[firstChar]?.append(friend)
//    } else {
//        sortedFriends[firstChar] = [friend]
//    }
//}
